app/views/accounts/show.html.erb

<table>
	<% @account.account_entries.each do |entry| %>
---
SELECT `account_entries`.* FROM `account_entries` WHERE `account_entries`.`account_id` = 4
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`type` IN ('Employee') AND `accounts`.`id` = 2 ORDER BY `accounts`.`id` ASC LIMIT 1